{
  "profile": {
    "uuid": "340e0a2f-2f38-4037-9989-7f4e716f76fa",
    "metadata": {
      "title": "Profile to Fill Parameters for AC-01",
      "last-modified": "2025-07-10T19:07:33Z",
      "version": "1.0.0",
      "oscal-version": "1.1.3"
    },
    "imports": [
      {
        "href": "https://raw.githubusercontent.com/bionicspy/oscal-content/main/catalog/nist_sp800_171_3.0.0.json"
      }
    ],
    "modify": {
      "set-parameters": [
        {
          "param-id": "ac-01_prm_01",
          "values": [
            "at most 90 days"
          ]
        },
        {
          "param-id": "ac-01_prm_02",
          "values": [
            "24 hours"
          ]
        },
        {
          "param-id": "ac-01_prm_03",
          "values": [
            "24 hours"
          ]
        },
        {
          "param-id": "ac-01_prm_04",
          "values": [
            "24 hours"
          ]
        },
        {
          "param-id": "ac-01_prm_05",
          "values": [
            "at most 24 hours"
          ]
        },
        {
          "param-id": "ac-01_prm_06",
          "values": [
            "the work period ends, for privileged users at a minimum"
          ]
        },
        {
          "param-id": "ac-05_prm_01",
          "values": [
            "at a minimum and if applicable: establishing system accounts and assigning privileges, configuring access authorizations, configuring settings for events to be audited, establishing vulnerability scanning parameters, establishing intrusion detection parameters, and managing audit information"
          ]
        },
        {
          "param-id": "ac-05_prm_02",
          "values": [
            "at a minimum and if applicable: threat and vulnerability information, filtering rules for routers or firewalls, configuration parameters for security services, cryptographic key management information, security architecture, access control lists, and audit information"
          ]
        },
        {
          "param-id": "ac-05_prm_03",
          "values": [
            "at least every 12 months"
          ]
        },
        {
          "param-id": "ac-06_prm_01",
          "values": [
            "only defined and authorized personnel or administrative roles"
          ]
        },
        {
          "param-id": "ac-08_prm_01",
          "values": [
            "at most five (5)"
          ]
        },
        {
          "param-id": "ac-08_prm_02",
          "values": [
            "period of five (5) minutes"
          ]
        },
        {
          "param-id": "ac-08_prm_03",
          "values": [
            "lock the account or node for an at least 15-minute time period",
            "lock the account or node until released by an administrator and notify a system administrator"
          ]
        },
        {
          "param-id": "ac-10_prm_01",
          "values": [
            "initiating a device lock after “at most 15 minutes” of inactivity and requiring the user to initiate a device lock before leaving the system unattended"
          ]
        },
        {
          "param-id": "ac-11_prm_01",
          "values": [
            "a specified duration (maximum of 24 hours) of inactivity, misbehavior (end the session due to an attempted policy violation), and maintenance (terminate sessions to prevent issues with an upgrade or service outage)"
          ]
        },
        {
          "param-id": "ac-20_prm_01",
          "values": [
            "Guidance: Organizations establish specific terms and conditions for the use of external systems in accordance with organizational security policies and procedures. At a minimum, terms and conditions address the specific types of applications that can be accessed on organizational systems from external systems and the highest security category of information that can be processed, stored, or transmitted on external systems. If the terms and conditions with the owners of the external systems cannot be established, organizations may impose restrictions on organizational personnel using those external systems. If applicable, use NIST SP 800-47 as a guide for establishing information exchanges between organizations."
          ]
        },
        {
          "param-id": "at-01_prm_01",
          "values": [
            "at least every 12 months"
          ]
        },
        {
          "param-id": "at-01_prm_02",
          "values": [
            "significant, novel incidents, or significant changes to risks"
          ]
        },
        {
          "param-id": "at-01_prm_03",
          "values": [
            "at least every 12 months"
          ]
        },
        {
          "param-id": "at-01_prm_04",
          "values": [
            "significant, novel incidents, or significant changes to risks"
          ]
        },
        {
          "param-id": "at-02_prm_01",
          "values": [
            "at least every 12 months"
          ]
        },
        {
          "param-id": "at-02_prm_02",
          "values": [
            "significant, novel incidents, or significant changes to risks"
          ]
        },
        {
          "param-id": "at-02_prm_03",
          "values": [
            "at least every 12 months"
          ]
        },
        {
          "param-id": "at-02_prm_04",
          "values": [
            "significant, novel incidents, or significant changes to risks"
          ]
        },
        {
          "param-id": "aa-01_prm_01",
          "values": [
            "at a minimum and where applicable:",
            "1) Authentication events:",
            "a) Logons (Success/Failure)",
            "b) Logoffs (Success)",
            "2) Security Relevant File and Objects events:",
            "a) Create (Success/Failure)",
            "b) Access (Success/Failure)",
            "c) Delete (Success/Failure)",
            "d) Modify (Success/Failure)",
            "e) Permission Modification (Success/Failure)",
            "f) Ownership Modification (Success/Failure)",
            "3) Export/Writes/downloads to devices/digital media (e.g., CD/DVD, USB, SD) (Success/Failure)",
            "4) Import/Uploads from devices/digital media (e.g., CD/DVD, USB, SD) (Success/Failure)",
            "5) User and Group Management events:",
            "a) User add, delete, modify, disable, lock (Success/Failure)",
            "b) Group/Role add, delete, modify (Success/Failure)",
            "6) Use of Privileged/Special Rights events:",
            "a) Security or audit policy changes (Success/Failure)",
            "b) Configuration changes (Success/Failure)",
            "7) Admin or root-level access (Success/Failure)",
            "8) Privilege/Role escalation (Success/Failure)",
            "9) Audit and security relevant log data accesses (Success/Failure)",
            "10) System reboot, restart, and shutdown (Success/Failure)",
            "11) Print to a device (Success/Failure)",
            "12) Print to a file (e.g., pdf format) (Success/Failure)",
            "13) Application (e.g., Adobe, Firefox, MS Office Suite) initialization (Success/Failure)",
            "For additional guidance, see: OMB21-31 ML 1"
          ]
        },
        {
          "param-id": "aa-01_prm_02",
          "values": [
            "at least every 12 months and after any significant incidents or significant changes to risks"
          ]
        },
        {
          "param-id": "aa-04_prm_01",
          "values": [
            "near real time or as soon as practicable upon discovery"
          ]
        },
        {
          "param-id": "aa-04_prm_02",
          "values": [
            "document the failure and resolution, troubleshoot, repair/restart the audit logging process, and report as incident if applicable"
          ]
        },
        {
          "param-id": "aa-05_prm_01",
          "values": [
            "at least weekly"
          ]
        },
        {
          "param-id": "aa-07_prm_01",
          "values": [
            "a granularity of one (1) second or smaller"
          ]
        },
        {
          "param-id": "cm-01_prm_01",
          "values": [
            "at least every 12 months and after any significant incidents or significant changes occur"
          ]
        },
        {
          "param-id": "cm-02_prm_01",
          "values": [
            "Apply the appropriate use of common security configurations available from the National Institute of Standards and Technology’s National Checklist Program (NCP) website (https://ncp.nist.gov/repository) and prevent remote devices from simultaneously establishing non-remote connections with organizational systems and communicating via some other unauthorized connection to resources in external networks. Document any deviations from the published standard or source document."
          ]
        },
        {
          "param-id": "cm-06_prm_01",
          "values": [
            "Guidance: Where feasible, organizations should limit component functionality to a single function per component. Organizations should consider removing unused or unnecessary software and disabling unused or unnecessary physical and logical ports and protocols to prevent unauthorized connection of components, transfer of information, and tunneling. Organizations should employ network scanning tools, intrusion detection and prevention systems, and end-point protection technologies, such as firewalls and host-based intrusion detection systems, to identify and prevent the use of prohibited functions, protocols, ports, and services. Least functionality should also be achieved as part of the fundamental design and development of the system."
          ]
        },
        {
          "param-id": "cm-06_prm_02",
          "values": [
            "at least every 12 months, when any system functions, ports, protocols, or services changes are made, and after any significant incidents or significant changes to risks"
          ]
        },
        {
          "param-id": "cm-08_prm_01",
          "values": [
            "at least quarterly"
          ]
        },
        {
          "param-id": "cm-10_prm_01",
          "values": [
            "at least quarterly"
          ]
        },
        {
          "param-id": "cm-12_prm_01",
          "values": [
            "a configuration that has no CUI or FCI stored on the system and prevents the processing, storing, and transmission of CUI and FCI, unless a specific exception is granted in writing by the Contracting Officer"
          ]
        },
        {
          "param-id": "cm-12_prm_02",
          "values": [
            "examine the system for signs of physical tampering and take the appropriate actions, and then either purge and reimage all storage media or destroy the system"
          ]
        },
        {
          "param-id": "ia-01_prm_01",
          "values": [
            "roles, authenticators, or credentials change (including modification of user privilege); when security categories of systems change; when the execution of privileged functions occurs; and after a session termination"
          ]
        },
        {
          "param-id": "ia-02_prm_01",
          "values": [
            "all devices for identification, where feasible for authentication, and document when not feasible"
          ]
        },
        {
          "param-id": "ia-05_prm_01",
          "values": [
            "at least ten (10) years"
          ]
        },
        {
          "param-id": "ia-05_prm_02",
          "values": [
            "privileged or non-privileged users; contractors, foreign nationals, and/or non-organizational users"
          ]
        },
        {
          "param-id": "ia-07_prm_01",
          "values": [
            "at least quarterly"
          ]
        },
        {
          "param-id": "ia-07_prm_02",
          "values": [
            "1) Must have a minimum length of 16 characters.",
            "2) Contains a string of characters that does not include the user's account name or full name."
          ]
        },
        {
          "param-id": "ia-12_prm_01",
          "values": [
            "never for passwords where MFA is employed, at least every five (5) years for hard tokens and identification badges, and at least every three (3) years for all other authenticators"
          ]
        },
        {
          "param-id": "ia-12_prm_02",
          "values": [
            "after a relevant security incident or any evidence of compromise or loss"
          ]
        },
        {
          "param-id": "ir-02_prm_01",
          "values": [
            "near real time or as soon as practicable upon discovery"
          ]
        },
        {
          "param-id": "ir-02_prm_02",
          "values": [
            "all applicable personnel and entities as specified by the contract, and in accordance with any incident response plan notification procedures"
          ]
        },
        {
          "param-id": "ir-03_prm_01",
          "values": [
            "at least every 12 months"
          ]
        },
        {
          "param-id": "ir-04_prm_01",
          "values": [
            "ten (10) days for privileged users, thirty (30) days for all other roles"
          ]
        },
        {
          "param-id": "ir-04_prm_02",
          "values": [
            "at least every 12 months"
          ]
        },
        {
          "param-id": "ir-04_prm_03",
          "values": [
            "at least every 12 months"
          ]
        },
        {
          "param-id": "ir-04_prm_04",
          "values": [
            "significant, novel incidents, or significant changes to risks"
          ]
        },
        {
          "param-id": "mp-07_prm_01",
          "values": [
            "any removable media not managed by or on behalf of the organization"
          ]
        },
        {
          "param-id": "ps-01_prm_01",
          "values": [
            "an organizational policy requiring rescreening when there is a significant incident, or change in status, related to an individual"
          ]
        },
        {
          "param-id": "ps-02_prm_01",
          "values": [
            "four (4) hours"
          ]
        },
        {
          "param-id": "pp-01_prm_01",
          "values": [
            "at least every 12 months, or when there are significant incidents or significant1 changes to risks"
          ]
        },
        {
          "param-id": "pp-02_prm_01",
          "values": [
            "at least every 45 days"
          ]
        },
        {
          "param-id": "pp-02_prm_02",
          "values": [
            "significant1, novel incidents, or significant changes to risks"
          ]
        },
        {
          "param-id": "pp-06_prm_01",
          "values": [
            "adequate security, comparable to organizational security requirements at the primary work site where practical, documented in policy, and covered by training"
          ]
        },
        {
          "param-id": "ra-01_prm_01",
          "values": [
            "at least every 12 months, or when there are significant incidents or significant changes to risks"
          ]
        },
        {
          "param-id": "ra-02_prm_01",
          "values": [
            "at least monthly, or when there are significant incidents or significant changes to risks"
          ]
        },
        {
          "param-id": "ra-02_prm_02",
          "values": [
            "thirty (30) days from date of discovery for high-risk vulnerabilities (including both critical and high); 90 days from date of discovery for moderate-risk vulnerabilities; and 180 days from date of discovery for low-risk vulnerabilities"
          ]
        },
        {
          "param-id": "ra-02_prm_03",
          "values": [
            "no more than 24 hours prior to running the scans"
          ]
        },
        {
          "param-id": "sa-01_prm_01",
          "values": [
            "at least every 12 months, or when there are significant incidents or significant changes to risks"
          ]
        },
        {
          "param-id": "sa-05_prm_01",
          "values": [
            "requirements as described in the contract"
          ]
        },
        {
          "param-id": "sa-05_prm_02",
          "values": [
            "at least every 12 months"
          ]
        },
        {
          "param-id": "scp-09_prm_01",
          "values": [
            "no longer than 15 minutes"
          ]
        },
        {
          "param-id": "scp-10_prm_01",
          "values": [
            "Guidance: At a minimum, establish a policy and procedure in line with the latest Cryptographic key management guidance"
          ]
        },
        {
          "param-id": "scp-11_prm_01",
          "values": [
            "FIPS Validated Cryptography (https://csrc.nist.gov/Projects/Cryptographic-Module-) Validation-Program/Validated-Modules"
          ]
        },
        {
          "param-id": "scp-12_prm_01",
          "values": [
            "only as enumerated and justified in the System Security Plan before such remote activation occurs, and only when there are no other options, and the remote activation is operationally critical"
          ]
        },
        {
          "param-id": "sii-01_prm_01",
          "values": [
            "thirty (30) days for high-risk flaws (including both critical and high), 90 days for moderate-risk flaws, and 180 days for low-risk flaws"
          ]
        },
        {
          "param-id": "sii-02_prm_01",
          "values": [
            "at least weekly"
          ]
        },
        {
          "param-id": "pl-01_prm_01",
          "values": [
            "at least every 12 months, or when there are significant incidents or significant changes to risks"
          ]
        },
        {
          "param-id": "pl-02_prm_01",
          "values": [
            "at least every 12 months, or when there are significant incidents or significant changes to risks"
          ]
        },
        {
          "param-id": "pl-03_prm_01",
          "values": [
            "at least every 12 months, or when there are significant incidents or significant changes to risks"
          ]
        },
        {
          "param-id": "ssa-01_prm_01",
          "values": [
            "Guidance: At a minimum, documentation that provides user and administrator guidance for the implementation and operation of controls. The level of detail required in such documentation should be based on the degree to which organizations depend on the capabilities, functions, or mechanisms to meet risk response expectations. Requirements can include mandated configuration settings that specify allowed functions, ports, protocols, and services. Acceptance criteria for systems, system components, and system services are defined in the same manner as the criteria for any organizational acquisition or procurement."
          ]
        },
        {
          "param-id": "ssa-03_prm_01",
          "values": [
            "1. For cloud service providers:",
            "(i) FedRAMP Authorized at the FedRAMP Moderate (or higher) baseline in accordance with the FedRAMP Marketplace; or",
            "(ii) meets security requirements established by the government equivalent to the FedRAMP Moderate (or higher) baseline.",
            "2. All other external service providers2 must meet NIST SP 800-171 R2."
          ]
        },
        {
          "param-id": "scr-01_prm_01",
          "values": [
            "at least every 12 months, or when there are significant incidents or significant changes to risks"
          ]
        },
        {
          "param-id": "scr-03_prm_01",
          "values": [
            "at a minimum, integrate Supply Chain Risk Management (SCRM) into acquisition/procurement policies, provide adequate SCRM resources, define the SCRM control baseline, establish processes to ensure suppliers disclose significant vulnerabilities and significant incidents"
          ]
        }
      ]
    }
  }
}